pages/3_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Prisoner's Dilemma</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The Prisoner's Dilemma</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-gameTheory">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Game theory is the study of how and why people make decisions.
</li>
<li>It is used extensively in the study of economics, and can often show surprising insights into how people behave. 
</li>
<li>We'll look at some of these in this unit, and code some different games along the way in both Scratch and Python. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The Prisoner's Dilemma is probably the most popular example of game theory in action. It demonstrates that people don't always act in their own best interests. 
</li>
</ul>

<iframe width="560" height="315" src="https://www.youtube.com/embed/t9Lo2fgxWHw" frameborder="0" allowfullscreen></iframe>

<ul class="org-ul">
<li>Imagine that two people have been arrested for a crime, and the police are uncertain which person committed the crime and which person helped carry it out. 
</li>
<li>Each prisoner is put into a different room and given a choice: 
<ul class="org-ul">
<li>Remain silent
</li>
<li>Betray your parter
</li>
</ul>
</li>
<li>If both stay silent, they will both be sent to prison for <b>1 year</b>.
</li>
<li>If they both betray one another, they can both be sent away for <b>3 years</b>.
</li>
<li>If one betrays the other, the betrayer goes <b>free</b>, and the other is imprisoned for <b>5 years</b>.
</li>

<li>The lowest total amount of prison time somes from both parties cooperating, <i>but</i> there's always the risk that the other person might not be as kind of you. 
</li>
<li>This becomes more interesting if we play the game once, then immediately play it again. Each player will now have a knowledge of how the other person behaved last time, and this will influence their decision making process. 
</li>
<li>If we assign points (based on minimizing time in jail), we can develop different game strategies to minimize the time the human player stays in jail over multiple games. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>The same idea can be seen in different places in human society. 
</li>
<li>Imagine a pair of competing fizzy drinks manufacturers. They both have two options when considering the sales of their products:
<ul class="org-ul">
<li><b>Option 1:</b> Don't spend money on advertising. People know your product already, and are currently buying it at a steady rate. 
</li>
<li><b>Option 2:</b> Spend money on advertising. It'll cost money, but sales will increase.
</li>
</ul>
</li>
<li>If both companies cooperate (option 1), they'll both enjoy steady profits and won't have to spend thousands of pounds on advertising.
</li>
<li>If one advertises and the other doesn't, one company will see their sales increase as the other company's sales (and profits) drop. 
</li>
<li>If both companies advertise, the effects of them both advertising will cancel each other out, and both companies will see their overall profits drop because of the money they're spending on advertising. 
</li>
<li>In real life, competing companies tend to advertise aggressively. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 code">
<h3 id="sec-1-4">Code It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>In a new browser tab, open <a href="https://scratch.mit.edu/projects/84074310/#editor">this link</a> to see a prisoner's dilemma simulator
</li>
<li>If you've a Scratch account, you can sign in to save the work you'll do here.
</li>
<li>If you've not got one, you can always click 'File -&gt; Download to your computer' when you're finished to ensure your work is saved.
</li>
<li>Unfortunately, it looks like the developer didn't have time to finish the code, and there are some blanks. 
</li>
<li>Based on the rules set out above, can you complete the code and make the game work?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">Silver</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Complete the code for the game.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">Gold</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>Modify the cat's strategy to be an 'angel'. It always stays silent, and never betrays the human player. 
</li>
<li>Develop a new 'Unpredictable puss' strategy for the cat, so that it betrays or stays silent at random. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">Platinum</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li>Modify the cat's strategy so that it holds a grudge&#x2026;
</li>
<li>It will remain silent every time the game is played, until the human player betrays, then&#x2026;
</li>
<li>It will then always betray the human player until the game is reset.
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
